# coding=utf-8
# @Time : 2023/5/31 下午3:18
# @File : global_var.py

html_label = {
    'lang_selection': {'ch': '中文', 'jp': '日本語'},
    'input_image_label': {'ch': '上传图片', 'jp': '画像をアップロード'},
    'batch_size_label': {'ch': 'Batch size', 'jp': '生成画像数'},
    'output_gender_label': {'ch': '输出性别', 'jp': '性別'},
    'output_gender_list': {'ch': ['女', '男'], 'jp': ['女', '男']},
    'output_viewpoint_label': {'ch': '输出视角', 'jp': 'viewpoint'},
    'output_viewpoint_list': {'ch': ['正面', '侧面', '背面'], 'jp': ['正', '侧', '背']},
    'output_age_label': {'ch': '输出年纪', 'jp': '年齢'},
    'input_part_list': {'ch': ['上衣', '下衣', '鞋子'], 'jp': ['上半身', '下半身', 'シューズ']},
    'input_part_label': {'ch': '输入列表', 'jp': '入力リスト'},
    'output_age_list': {'ch': ['儿童', '青年', '中年'], 'jp': ['子ども', '青年', '中年']},
    'generate_btn_label': {'ch': '生成', 'jp': '生成'},
    'interrupt_btn_label': {'ch': '中断', 'jp': '中断'},
    'output_gallery_label': {'ch': '结果', 'jp': '結果'},
    'hint1': {'ch': '这个软件具备服装着装可视化的功能。可以将图像中展示的服装从假人和衣架的形象转换为真实的人体形象。这样，用户可以更真实地想象出服装的效果。', 'jp': '本システムは衣料品の着用可視化機能を持っています。画像内に表示されている衣料品を身に着けたマネキンやハンガーを実際の人物に変換します。これにより、ユーザーは実際にその衣料品がどのように見えるかをよりリアルに想像することができます。'},
    'hint2': {'ch': '输入图像的注意事项：\n1,图像中的模特，服装和背景，三者颜色保持不同。\n2,图像中不要遮挡需要展示的服装。\n3,为了生成完整的头部和四肢，图像中服装在中心位置,服装周围请留出一些空间。\n4,图像中的服装不要透明。\n5,如果生成的图像不符合您的期望，请再多生成几次。\n6,图像竖立显示', 'jp': '画像入力の注意点：\n1,画像内のモデル、衣類、背景の色を異ならせてください。\n2,画像内の衣類をブロックしないでください。\n3,頭や手足を生成するために、画像の衣類は中央にあり、衣類の周りにスペースを空けてください。\n4,衣類が透けないようにしてください。\n5,生成された画像がご期待に添えない場合は、もう数回生成してください。\n6,画像は縦に表示されるようにしてください。'},
}
